'use client';

import { createClient } from '@/utils/supabase/client';
// 회원가입 페이지 코드와 겹치는 부분이 많은데 나중에 리팩토링 해야함
// 겹치는 부분 커스텀 훅으로 분리

import useAuthStore from '@/zustand/authStore';
import clsx from 'clsx';
import Link from 'next/link';
import { useRouter } from 'next/navigation';
import { FormEventHandler, useRef, useState } from 'react';

const inputs = [
  { label: '이메일', type: 'text', id: 'email' },
  { label: '비밀번호', type: 'password', id: 'pw', icon: true }
];

export default function LoginPage() {
  const inputRefs = useRef<(HTMLInputElement | null)[]>([]);
  const [selectedIdx, setSelectedIdx] = useState<number | null>(null);
  const [inputValues, setInputValue] = useState<(string | null)[]>(Array(inputs.length).fill(''));
  const [showPassword, setShowPassword] = useState<boolean>(false);

  const router = useRouter();

  const { login, setUserId, setUserData } = useAuthStore();

  const handleInputChange = (idx: number, e: React.ChangeEvent<HTMLInputElement>) => {
    const newValues = [...inputValues];
    newValues[idx] = e.target.value;
    setInputValue(newValues);
  };

  const handleTogglePassword = (): void => {
    const newVisibility = !showPassword;
    setShowPassword(newVisibility);
  };

  const handleLogin: FormEventHandler<HTMLFormElement> = async (e) => {
    e.preventDefault();

    const form = e.target as HTMLFormElement;
    const formData = new FormData(form);

    const email: string = formData.get('email') as string;
    const password: string = formData.get('pw') as string;

    const dataForSubmit = { email, password };
    const data = await fetch('/api/login', {
      method: 'POST',
      headers: {
        'Content-Type': 'application/json'
      },
      body: JSON.stringify(dataForSubmit)
    }).then((res) => res.json());

    if (data.errorMsg) {
      alert(data.errorMsg);
      return;
    }
    alert('로그인 성공!');
    form.reset();
    login();
    console.log(data.userData);
    setUserId(data.userData.user.id);
    setUserData(data.userData.user.user_metadata);

    router.back(); // 이거 나중에 고쳐야 함!!
  };

  const handleKakaoLogin = async () => {
    const supabase = createClient();
    const { data, error } = await supabase.auth.signInWithOAuth({
      provider: 'kakao',
      options: {
        redirectTo: 'http://localhost:3000/signup/signUpComplete'
      }
    });
    if (error) console.log('카카오 로그인 에러');
    if (data) console.log(data);
  };

  const handleGoogleLogin = async () => {
    const supabase = createClient();
    const { data, error } = await supabase.auth.signInWithOAuth({
      provider: 'google',
      options: {
        redirectTo: 'http://localhost:3000/signup/signUpComplete',
        queryParams: {
          access_type: 'offline',
          prompt: 'consent'
        }
      }
    });
    if (error) console.log('구글 로그인 에러');
    if (data) console.log(data);
  };

  const handleGitHubLogin = async () => {
    const supabase = createClient();
    const { data, error } = await supabase.auth.signInWithOAuth({
      provider: 'github',
      options: {
        redirectTo: 'http://localhost:3000/signup/signUpComplete'
      }
    });
    if (error) console.log('깃허브 로그인 에러');
    if (data) console.log(data);
  };

  const buttonStyle =
    'h-[56px] w-[400px] rounded-[12px] text-black font-bold flex justify-center items-center gap-[32px]';

  return (
    <section className="flex flex-col text-center items-center py-[64px]">
      {/* <section> */}
      <form onSubmit={handleLogin} className="flex flex-col gap-[10px] items-center">
        <svg
          className="mb-[48px]"
          width="180"
          height="60"
          viewBox="0 0 180 60"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M8.58534 26.6108L8.55441 26.5798L20.0097 15.1245C21.4722 13.662 23.8713 13.5523 25.3619 14.9867C26.8525 16.4211 26.8975 18.8651 25.4125 20.3501L16.961 28.8017C16.3085 29.4542 16.3085 30.5145 16.961 31.167L25.3169 39.5229C26.785 40.9911 26.8975 43.4014 25.4547 44.8892C23.9922 46.3995 21.5791 46.4136 20.0997 44.9314L8.85816 33.6898C6.91753 31.7492 6.83034 28.6583 8.58816 26.6079L8.58534 26.6108Z"
            fill="#253CE5"
          />
          <path
            d="M149.612 19.1471C150.1 17.3562 149.043 15.5088 147.253 15.0209C145.462 14.533 143.614 15.5893 143.126 17.3802L136.731 40.8528C136.243 42.6437 137.3 44.4911 139.091 44.979C140.882 45.4669 142.729 44.4106 143.217 42.6197L149.612 19.1471Z"
            fill="#253CE5"
          />
          <path
            d="M48.8819 33.4931C51.0363 33.4931 52.6478 35.5068 52.1388 37.5993C51.9053 38.5584 51.596 39.4106 51.205 40.1559C49.4838 43.3537 46.5138 44.6109 41.4175 44.6109C33.8913 44.6109 29.5375 40.6115 29.5038 32.7309V28.9622C29.4363 21.27 33.4188 17.4253 41.4175 17.4253C46.7781 17.4253 50.2319 19.3322 51.776 23.5734C52.5747 25.7644 50.9716 28.0875 48.64 28.0875H48.5585C47.2281 28.0875 46.0019 27.3056 45.4928 26.0765C44.8122 24.4312 43.5578 23.6325 41.35 23.6325C37.9413 23.6325 36.5913 25.2694 36.625 29.4965V32.3512C36.6588 36.7303 38.3125 38.4431 41.6875 38.4431C43.96 38.4431 45.1469 37.6894 45.6728 35.8978C46.0919 34.4747 47.3969 33.4931 48.8819 33.4931Z"
            fill="#253CE5"
          />
          <path
            d="M54.3694 36.8851V32.9026C54.3385 27.5026 57.0666 25.4438 62.911 25.4438C68.6963 25.4776 71.3935 27.5364 71.3625 32.9026V36.8851C71.3316 42.3189 68.4263 44.6139 62.821 44.6139C57.2157 44.6139 54.3975 42.3189 54.3694 36.8851Z"
            fill="#253CE5"
          />
          <path
            d="M73.0742 37.3913V32.6663C73.0742 30.9451 73.3442 29.5613 73.8505 28.5151C74.863 26.4901 77.0567 25.5451 80.938 25.5451H83.9417V23.9757C83.9417 22.1588 85.4155 20.6851 87.2323 20.6851C89.0492 20.6851 90.523 22.1588 90.523 23.9757V39.3601C90.523 42.001 88.3827 44.1413 85.7417 44.1413H80.0605C75.0992 44.1413 73.0742 42.1163 73.0742 37.3913Z"
            fill="#253CE5"
          />
          <path
            d="M101.619 44.6109C95.5776 44.6109 92.2363 42.0459 92.2363 37.0172V33.6422C92.2363 27.8709 95.3751 25.4409 101.619 25.4409C107.863 25.4409 110.934 28.3434 110.934 33.9122C110.954 35.7515 109.466 37.2534 107.626 37.2534H99.3407C98.556 37.2534 98.0526 38.145 98.5138 38.7806C99.0454 39.5119 100.038 39.855 101.619 39.855C103.008 39.855 103.993 39.6272 104.535 39.0534C105.002 38.5584 105.621 38.235 106.302 38.235H108.093C109.685 38.235 110.72 39.9872 109.879 41.34C108.504 43.5478 105.604 44.6137 101.622 44.6137L101.619 44.6109ZM103.379 33.0712C104.33 33.0712 104.755 31.8815 104.024 31.274C103.43 30.7819 102.584 30.509 101.582 30.509C100.407 30.509 99.4926 30.7734 98.9104 31.3275C98.2495 31.9547 98.7023 33.074 99.6135 33.074H103.379V33.0712Z"
            fill="#253CE5"
          />
          <path
            d="M128.254 35.3015V21.1547C128.254 19.0931 129.925 17.4253 131.984 17.4253H132.099C134.16 17.4253 135.828 19.0959 135.828 21.1547V34.095C135.828 41.2612 132.214 44.6109 124.252 44.6109C116.29 44.6109 112.676 41.3006 112.676 34.095V21.1547C112.676 19.0931 114.346 17.4253 116.405 17.4253C118.467 17.4253 120.135 19.0959 120.135 21.1547V35.3409C120.135 37.3265 121.518 38.339 124.249 38.339C126.98 38.339 128.249 37.3265 128.249 35.3015H128.254Z"
            fill="#253CE5"
          />
          <path
            d="M60.1477 36.4919C61.8019 36.4919 63.143 34.9607 63.143 33.0719C63.143 31.1831 61.8019 29.6519 60.1477 29.6519C58.4934 29.6519 57.1523 31.1831 57.1523 33.0719C57.1523 34.9607 58.4934 36.4919 60.1477 36.4919Z"
            fill="white"
          />
          <path
            d="M60.6362 34.2274C61.5356 34.2274 62.2647 33.3951 62.2647 32.3684C62.2647 31.3416 61.5356 30.5093 60.6362 30.5093C59.7369 30.5093 59.0078 31.3416 59.0078 32.3684C59.0078 33.3951 59.7369 34.2274 60.6362 34.2274Z"
            fill="#253CE5"
          />
          <path
            d="M65.6633 36.4919C67.3175 36.4919 68.6586 34.9607 68.6586 33.0719C68.6586 31.1831 67.3175 29.6519 65.6633 29.6519C64.009 29.6519 62.668 31.1831 62.668 33.0719C62.668 34.9607 64.009 36.4919 65.6633 36.4919Z"
            fill="white"
          />
          <path
            d="M66.1519 34.2274C67.0512 34.2274 67.7803 33.3951 67.7803 32.3684C67.7803 31.3416 67.0512 30.5093 66.1519 30.5093C65.2525 30.5093 64.5234 31.3416 64.5234 32.3684C64.5234 33.3951 65.2525 34.2274 66.1519 34.2274Z"
            fill="#253CE5"
          />
          <path
            d="M83.7082 36.4916C85.3625 36.4916 86.7035 34.9604 86.7035 33.0716C86.7035 31.1828 85.3625 29.6516 83.7082 29.6516C82.0539 29.6516 80.7129 31.1828 80.7129 33.0716C80.7129 34.9604 82.0539 36.4916 83.7082 36.4916Z"
            fill="white"
          />
          <path
            d="M83.2193 34.2279C84.1186 34.2279 84.8477 33.3956 84.8477 32.3688C84.8477 31.3421 84.1186 30.5098 83.2193 30.5098C82.3199 30.5098 81.5908 31.3421 81.5908 32.3688C81.5908 33.3956 82.3199 34.2279 83.2193 34.2279Z"
            fill="#253CE5"
          />
          <path
            d="M78.1936 36.4916C79.8478 36.4916 81.1889 34.9604 81.1889 33.0716C81.1889 31.1828 79.8478 29.6516 78.1936 29.6516C76.5393 29.6516 75.1982 31.1828 75.1982 33.0716C75.1982 34.9604 76.5393 36.4916 78.1936 36.4916Z"
            fill="white"
          />
          <path
            d="M77.7046 34.2274C78.604 34.2274 79.3331 33.3951 79.3331 32.3684C79.3331 31.3416 78.604 30.5093 77.7046 30.5093C76.8053 30.5093 76.0762 31.3416 76.0762 32.3684C76.0762 33.3951 76.8053 34.2274 77.7046 34.2274Z"
            fill="#253CE5"
          />
          <path
            d="M171.414 26.6108L171.445 26.5798L159.99 15.1245C158.527 13.662 156.128 13.5523 154.638 14.9867C153.147 16.4211 153.102 18.8651 154.587 20.3501L163.038 28.8017C163.691 29.4542 163.691 30.5145 163.038 31.167L154.683 39.5229C153.214 40.9911 153.102 43.4014 154.545 44.8892C156.007 46.3995 158.42 46.4136 159.9 44.9314L171.141 33.6898C173.082 31.7492 173.169 28.6583 171.411 26.6079L171.414 26.6108Z"
            fill="#253CE5"
          />
        </svg>
        {inputs.map((input, idx) => (
          <div key={idx} className="flex flex-col items-center relative">
            <div
              className={clsx(
                idx === selectedIdx || inputValues[idx]!.length > 0
                  ? 'h-[70px] w-[400px] border border-black rounded-[8px] px-[16px] pt-[6px]'
                  : 'h-[56px] w-[400px] border border-main p-[16px] rounded-[8px]'
              )}
            >
              <label
                className={clsx(
                  idx === selectedIdx || inputValues[idx]!.length > 0 ? 'flex' : 'hidden',
                  'self-start text-[12px]'
                )}
                htmlFor={input.id}
              >
                {input.label}
              </label>
              <div className="flex">
                <input
                  className={clsx(
                    (idx === selectedIdx || inputValues[idx]!.length > 0) &&
                      'w-[312px] outline-none border-none p-0 mt-[5px]'
                  )}
                  type={showPassword ? 'text' : input.type}
                  id={input.id}
                  name={input.id}
                  placeholder={input.label}
                  ref={(el) => {
                    inputRefs.current[idx] = el;
                  }}
                  onClick={() => setSelectedIdx(idx)}
                  value={inputValues[idx] || ''}
                  onChange={(e) => handleInputChange(idx, e)}
                />
                {input.icon && (
                  <button type="button" className="flex items-center" onClick={handleTogglePassword}>
                    <svg
                      className={clsx('absolute right-[16px] cursor-pointer', showPassword ? 'block' : 'hidden')}
                      width="24"
                      height="25"
                      viewBox="0 0 24 25"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M14.9997 12.2241C14.9997 13.881 13.6566 15.2241 11.9997 15.2241C10.3429 15.2241 8.99971 13.881 8.99971 12.2241C8.99971 10.5673 10.3429 9.22412 11.9997 9.22412C13.6566 9.22412 14.9997 10.5673 14.9997 12.2241Z"
                        stroke="black"
                      />
                      <path
                        d="M19.1613 11.1526C19.5612 11.6211 19.7611 11.8554 19.7611 12.2241C19.7611 12.5929 19.5612 12.8271 19.1613 13.2957C17.8496 14.8324 15.1353 17.4792 11.9997 17.4792C8.8641 17.4792 6.14983 14.8324 4.83814 13.2957C4.43823 12.8271 4.23828 12.5929 4.23828 12.2241C4.23828 11.8554 4.43823 11.6211 4.83814 11.1526C6.14983 9.6158 8.8641 6.96899 11.9997 6.96899C15.1353 6.96899 17.8496 9.6158 19.1613 11.1526Z"
                        stroke="black"
                      />
                    </svg>
                    <svg
                      className={clsx('absolute right-[16px] cursor-pointer', showPassword ? 'hidden' : 'block')}
                      width="24"
                      height="25"
                      viewBox="0 0 24 25"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        fill-rule="evenodd"
                        clip-rule="evenodd"
                        d="M6.47352 8.81945C5.6371 9.51906 4.94926 10.2522 4.45783 10.828L4.39811 10.8977C4.05659 11.296 3.73828 11.6672 3.73828 12.2241C3.73828 12.7811 4.05659 13.1523 4.39811 13.5505L4.45783 13.6203C5.12934 14.407 6.16759 15.4877 7.45054 16.375C8.73034 17.2601 10.292 17.9792 11.9997 17.9792C13.0481 17.9792 14.0414 17.7082 14.9482 17.2942L14.1866 16.5326C13.4863 16.8115 12.752 16.9792 11.9997 16.9792C10.5718 16.9792 9.20853 16.375 8.01937 15.5525C6.83335 14.7322 5.85862 13.7211 5.21845 12.9711C4.7818 12.4595 4.73828 12.3723 4.73828 12.2241C4.73828 12.076 4.7818 11.9888 5.21845 11.4772C5.70101 10.9118 6.37367 10.1981 7.18363 9.52956L6.47352 8.81945ZM8.70219 11.0481C8.5711 11.4157 8.49971 11.8116 8.49971 12.2241C8.49971 14.1571 10.0667 15.7241 11.9997 15.7241C12.4123 15.7241 12.8082 15.6527 13.1757 15.5216L12.3534 14.6993C12.2378 14.7157 12.1198 14.7241 11.9997 14.7241C10.619 14.7241 9.49971 13.6048 9.49971 12.2241C9.49971 12.1041 9.50818 11.986 9.52454 11.8705L8.70219 11.0481ZM11.6457 9.74899L10.8234 8.9267C11.191 8.79554 11.587 8.72412 11.9997 8.72412C13.9327 8.72412 15.4997 10.2911 15.4997 12.2241C15.4997 12.6368 15.4283 13.0328 15.2971 13.4004L14.4748 12.5781C14.4912 12.4625 14.4997 12.3443 14.4997 12.2241C14.4997 10.8434 13.3804 9.72412 11.9997 9.72412C11.8795 9.72412 11.7613 9.7326 11.6457 9.74899ZM16.8156 14.9189C17.6256 14.2503 18.2984 13.5365 18.781 12.9711C19.2176 12.4595 19.2611 12.3723 19.2611 12.2241C19.2611 12.076 19.2176 11.9888 18.781 11.4772C18.1408 10.7272 17.1661 9.71601 15.9801 8.89572C14.7909 8.07327 13.4276 7.46899 11.9997 7.46899C11.2474 7.46899 10.5129 7.63675 9.8125 7.91579L9.05092 7.1542C9.95785 6.74007 10.9513 6.46899 11.9997 6.46899C13.7074 6.46899 15.2691 7.18812 16.5489 8.07327C17.8318 8.96059 18.8701 10.0412 19.5416 10.828L19.6013 10.8977L19.6013 10.8977C19.9428 11.296 20.2611 11.6672 20.2611 12.2241C20.2611 12.7811 19.9428 13.1523 19.6013 13.5505L19.5416 13.6203C19.0501 14.1961 18.3622 14.9293 17.5257 15.629L16.8156 14.9189Z"
                        fill="black"
                      />
                      <path
                        fill-rule="evenodd"
                        clip-rule="evenodd"
                        d="M3.67184 3.89596C3.8671 3.7007 4.18368 3.7007 4.37894 3.89596L20.328 19.8451C20.5233 20.0403 20.5233 20.3569 20.328 20.5522C20.1328 20.7474 19.8162 20.7474 19.6209 20.5522L3.67184 4.60307C3.47658 4.4078 3.47658 4.09122 3.67184 3.89596Z"
                        fill="black"
                      />
                    </svg>
                  </button>
                )}
              </div>
            </div>
          </div>
        ))}
        <button
          type="submit"
          className="h-[56px] w-[400px] rounded-[8px] bg-primary-500 hover:bg-primary-700 text-white font-bold mt-[48px] mb-[16px]"
        >
          로그인
        </button>
      </form>

      <div className="w-[400px] text-[#afafaf] flex justify-center mb-[48px]">
        <Link href="#" className="mx-[40px] hover:underline">
          아이디 찾기
        </Link>
        <Link href="#" className="mx-[40px] hover:underline">
          비밀번호 찾기
        </Link>
      </div>

      <div className="flex flex-col mb-[48px]">
        <p className="text-[#afafaf] text-[12px] mb-[24px]">─────────── 다른 방법으로 로그인 ───────────</p>
        <div className="flex flex-col items-center gap-[16px]">
          <button onClick={handleKakaoLogin} className={clsx(buttonStyle, 'bg-[#fee500] hover:bg-[#EED600]')}>
            <svg width="26" height="27" viewBox="0 0 26 27" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_734_3680)">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M12.75 1.59985C5.708 1.59985 0 6.00988 0 11.4489C0 14.8316 2.20774 17.8136 5.56966 19.5872L4.15512 24.7546C4.03015 25.2111 4.55234 25.5751 4.95332 25.3105L11.1539 21.2181C11.6772 21.2686 12.2089 21.2981 12.75 21.2981C19.7915 21.2981 25.4999 16.8883 25.4999 11.4489C25.4999 6.00988 19.7915 1.59985 12.75 1.59985"
                  fill="black"
                />
              </g>
              <defs>
                <clipPath id="clip0_734_3680">
                  <rect width="25.4999" height="25.5" fill="white" transform="translate(0 0.75)" />
                </clipPath>
              </defs>
            </svg>
            카카오로 로그인하기
          </button>
          <button onClick={handleGoogleLogin} className={clsx(buttonStyle, 'bg-[#F8F9FD] hover:bg-[#E2E5F3]')}>
            <svg width="26" height="27" viewBox="0 0 103 105" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M102.019 53.204C102.08 49.6257 101.711 46.053 100.919 42.563H52.0508V61.879H80.7358C80.1924 65.2658 78.9696 68.5078 77.1409 71.4099C75.3122 74.3119 72.9155 76.8141 70.0948 78.766L69.9948 79.413L85.4468 91.383L86.5168 91.49C96.3478 82.41 102.017 69.05 102.017 53.204"
                fill="#4285F4"
              />
              <path
                d="M52.0488 104.1C66.1018 104.1 77.8998 99.473 86.5178 91.492L70.0928 78.768C65.6978 81.834 59.7988 83.974 52.0488 83.974C45.4668 83.9355 39.064 81.8253 33.7489 77.9427C28.4338 74.0602 24.4763 68.6025 22.4378 62.344L21.8278 62.396L5.76078 74.83L5.55078 75.414C9.87802 84.0381 16.5189 91.2885 24.7308 96.3544C32.9427 101.42 42.402 104.102 52.0508 104.1"
                fill="#34A853"
              />
              <path
                d="M22.4388 62.3439C21.3003 59.0307 20.7129 55.5532 20.6998 52.0499C20.7208 48.5523 21.2866 45.0793 22.3768 41.7559L22.3478 41.0659L6.08381 28.4319L5.55181 28.6849C1.90142 35.9324 0 43.9345 0 52.0494C0 60.1643 1.90142 68.1664 5.55181 75.4139L22.4388 62.3439Z"
                fill="#FBBC05"
              />
              <path
                d="M52.0508 20.126C59.5091 20.0101 66.7224 22.7878 72.1768 27.876L86.8668 13.533C77.4451 4.69427 64.9685 -0.155404 52.0508 -4.13142e-05C42.4021 -0.00233698 32.9429 2.67933 24.731 7.74511C16.5191 12.8109 9.87816 20.0611 5.55078 28.685L22.3818 41.756C24.4403 35.4985 28.411 30.045 33.7339 26.1644C39.0569 22.2837 45.4636 20.1717 52.0508 20.126Z"
                fill="#EB4335"
              />
            </svg>
            Google로 로그인하기
          </button>
          <button onClick={handleGitHubLogin} className={clsx(buttonStyle, 'bg-[#ECEDF0] hover:bg-[#D9DEE3]')}>
            <svg width="26" height="27" viewBox="0 0 26 27" fill="none" xmlns="http://www.w3.org/2000/svg">
              <rect y="0.75" width="25.5" height="25.5" rx="12.75" fill="white" />
              <path
                d="M12.75 0.75C19.7944 0.75 25.5 6.45562 25.5 13.5C25.4993 16.1714 24.6609 18.7754 23.1027 20.9454C21.5446 23.1154 19.3452 24.7421 16.8141 25.5966C16.1766 25.7241 15.9375 25.3256 15.9375 24.9909C15.9375 24.5606 15.9534 23.19 15.9534 21.4847C15.9534 20.2894 15.555 19.5244 15.0928 19.1259C17.9297 18.8072 20.91 17.7234 20.91 12.8306C20.91 11.4281 20.4159 10.2966 19.6031 9.40406C19.7306 9.08531 20.1769 7.77844 19.4756 6.02531C19.4756 6.02531 18.4078 5.67469 15.9694 7.33219C14.9494 7.04531 13.8656 6.90187 12.7819 6.90187C11.6981 6.90187 10.6144 7.04531 9.59438 7.33219C7.15594 5.69062 6.08813 6.02531 6.08813 6.02531C5.38688 7.77844 5.83313 9.08531 5.96063 9.40406C5.14781 10.2966 4.65375 11.4441 4.65375 12.8306C4.65375 17.7075 7.61813 18.8072 10.455 19.1259C10.0884 19.4447 9.75375 20.0025 9.64219 20.8312C8.90907 21.1659 7.07625 21.7078 5.92875 19.7794C5.68969 19.3969 4.9725 18.4566 3.96844 18.4725C2.90063 18.4884 3.53813 19.0781 3.98438 19.3172C4.52625 19.62 5.14781 20.7516 5.29125 21.1181C5.54625 21.8353 6.375 23.2059 9.57844 22.6162C9.57844 23.6841 9.59438 24.6881 9.59438 24.9909C9.59438 25.3256 9.35531 25.7081 8.71781 25.5966C6.17839 24.7513 3.96961 23.1279 2.40479 20.9566C0.839981 18.7853 -0.00140326 16.1764 1.75681e-06 13.5C1.75681e-06 6.45562 5.70563 0.75 12.75 0.75Z"
                fill="#24292F"
              />
            </svg>
            GitHub로 로그인하기
          </button>
        </div>
      </div>

      <div className="flex justify-center gap-[24px] text-[12px]">
        <p>아직 회원이 아니신가요?</p>
        <Link href="/signup" className="font-bold">
          회원가입 하기 {'>'}
        </Link>
      </div>
    </section>
  );
}
