export const postDumy = [
  {
    id: 1,
    title: '제목제목제목제목제목제목',
    content:
      '내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.11',
    view: '21',
    like: '11',
    image: 'https://via.placeholder.com/150?text=Expert+1'
  },
  {
    id: 2,
    title: '2제목제목제목제목제목제목',
    content:
      '2내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.12',
    view: '22',
    like: '12'
  },
  {
    id: 3,
    title: '3제목제목제목제목제목제목',
    content:
      '3내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.13',
    view: '23',
    like: '13'
  },
  {
    id: 4,
    title: '4제목제목제목제목제목제목',
    content:
      '4내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.14',
    view: '24',
    like: '14'
  },
  {
    id: 5,
    title: '5제목제목제목제목제목제목',
    content:
      '5내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.15',
    view: '25',
    like: '15'
  },
  {
    id: 6,
    title: '6제목제목제목제목제목제목',
    content:
      '6내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.16',
    view: '26',
    like: '16'
  },
  {
    id: 7,
    title: '7제목제목제목제목제목제목',
    content:
      '7내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.17',
    view: '27',
    like: '17'
  },
  {
    id: 8,
    title: '8제목제목제목제목제목제목',
    content:
      '8내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.18',
    view: '28',
    like: '18'
  },
  {
    id: 9,
    title: '9제목제목제목제목제목제목',
    content:
      '9내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용내용',
    date: '2024.07.19',
    view: '29',
    like: '19'
  }
];
